
#Область ПрограммныйИнтерфейс

// Отправка уведомления в телеграмм.
// 
// Параметры:
//  Уведомление - структура - структура для пердачи уведомления:
//  	* Токен - строка - токен бота в телеграмме
//  	* ИдентификаторГруппы - строка - идентификатор группы для оповещения
//  	* Уведомление - СправочникСсылка - ссылка на элемент справочника Уведомлений
Процедура ОтправкаУведомленияВТелеграмм(Уведомление) Экспорт
	Если НЕ ЗначениеЗаполнено(Уведомление) Тогда
		Возврат;
	КонецЕсли;
		
	//Созаем соединение
	ДанныеСеанса = ПолучитьДанныеСеанса(Уведомление.Токен);
	//Устанавливаем Http соединение 
	Соединение = СоздатьHTTPСоединение(ДанныеСеанса); 
	
	//Формируем запрос
	ЗапросБоту = СоздатьHTTPЗапрос(ДанныеСеанса.АдресРесурса);
	ЗапросБоту.Заголовки.Вставить("Content-Type", "application/json");
	Тело = Новый Структура ("chat_id, text");
	Тело.chat_id = Уведомление.ИдентификаторГруппы;
	Тело.text = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление.Уведомление,"Текст");
	ЗапросБоту.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(Тело));
	
	//Получаем ответ
	Ответ =  Соединение.Получить(ЗапросБоту);
	
	//действия с полученным ответом
	Если Ответ.КодСостояния = 200 Тогда 
		//Уведомление передано
		ЭлементСпр = Уведомление.Сообщение.ПолучитьОбъект();
		ЭлементСпр.Удалить();
		Возврат;
	КонецЕсли;
	// произошла ошибка пишем в журнал
	//ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункци

Функция ПолучитьДанныеСеанса(ТокенБота)
	//https://api.telegram.org , ресурс - /bot[ВашТокен]/sendMessage
	Результат = Новый Структура; 
	Результат.Вставить("АдресСервера","api.telegram.org");
	Результат.Вставить("АдресРесурса", СтрШаблон("/bot%1/sendMessage", ТокенБота));
	Результат.Вставить("ЗащищенноеСоединение",Истина);  
	
	Возврат Результат;
КонецФункции

Функция СоздатьHTTPСоединение(ДанныеСеанса)
	
	ЗащищенноеСоединение = Неопределено;
	Если ДанныеСеанса.ЗащищенноеСоединение Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;  
	КонецЕсли;
	
	Результат = Новый HTTPСоединение(ДанныеСеанса.АдресСервера,,,
			,,,ЗащищенноеСоединение);
	
	Возврат Результат;
КонецФункции

Функция СоздатьHTTPЗапрос(АдресРесурса)
	
	Результат = Новый HTTPЗапрос(АдресРесурса);
	
	Возврат Результат;
КонецФункции


#КонецОбласти
