
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентаВыполненыеРаботы.Ссылка.Сотрудник КАК Сотрудник,
	|	ВКМ_ОбслуживаниеКлиентаВыполненыеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
	|	ВКМ_ОбслуживаниеКлиентаВыполненыеРаботы.СтавкаЧасаКлиента КАК СтавкаЧасаКлиента
	|ПОМЕСТИТЬ ВТ_Работы
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненыеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненыеРаботы
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентаВыполненыеРаботы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Работы.Сотрудник КАК Сотрудник,
	|	ВТ_Работы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
	|	ВТ_Работы.СтавкаЧасаКлиента КАК СтавкаЧасаКлиента,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, ""NULL"") КАК ПроцентОтРабот
	|ИЗ
	|	ВТ_Работы КАК ВТ_Работы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
	|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_Работы.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник";
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	Запрос.УстановитьПараметр("Дата",Дата );
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();	
	
	// регистр ВКМ_ВыполненыеСотрудникомРаботы
	Движения.ВКМ_ВыполненыеСотрудникомРаботы.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПроцентОтРабот = NULL Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Отмена проведения! Сотруднику не задан процент от работ.");
			Возврат;
		КонецЕсли;
		Движение = Движения.ВКМ_ВыполненыеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.ЧасовКОплате = Выборка.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * Выборка.СтавкаЧасаКлиента * Выборка.ПроцентОтРабот/100 ;		
	КонецЦикла;

КонецПроцедуры
#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
