
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	Строка = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	РасчетДатОтпускаПриИзменении(Строка, "Н");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	Строка = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	РасчетДатОтпускаПриИзменении(Строка, "О");
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковКоличествоДнейПриИзменении(Элемент)
	Строка = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	РасчетДатОтпускаПриИзменении(Строка, "К");
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчетДатОтпускаПриИзменении(ТекущиеДанные, ЧтоИзменилось)
	
	СекундВДне = 60*60*24;
	
	Если ЧтоИзменилось = "Н" Тогда //Изменилось поле ДатаНачала
		Если ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) Тогда
			Если ТекущиеДанные.КоличествоДней > 0 Тогда
				ТекущиеДанные.ДатаОкончания = ТекущиеДанные.ДатаНачала + (СекундВДне * (ТекущиеДанные.КоличествоДней -1));
			Иначе
				Если ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания)  Тогда
					Если ТекущиеДанные.ДатаОкончания > ТекущиеДанные.ДатаНачала Тогда
						ТекущиеДанные.КоличествоДней = (ТекущиеДанные.ДатаОкончания - ТекущиеДанные.ДатаНачала)/СекундВДне +1;
					Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка дат!");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ТекущиеДанные.КоличествоДней = 0;
		КонецЕсли;
	ИначеЕсли ЧтоИзменилось = "О" Тогда //Изменилось поле ДатаОкончания
		Если ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
			Если ТекущиеДанные.КоличествоДней > 0 Тогда
				ТекущиеДанные.ДатаНачала = ТекущиеДанные.ДатаОкончания - (СекундВДне * (ТекущиеДанные.КоличествоДней -1));
			Иначе
				Если ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала)  Тогда
					Если ТекущиеДанные.ДатаОкончания > ТекущиеДанные.ДатаНачала Тогда
						ТекущиеДанные.КоличествоДней = (ТекущиеДанные.ДатаОкончания - ТекущиеДанные.ДатаНачала)/СекундВДне +1;
					Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка дат!");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ТекущиеДанные.КоличествоДней = 0;
		КонецЕсли;
	ИначеЕсли ЧтоИзменилось = "К" Тогда //Изменилось поле количество дней
		Если ТекущиеДанные.КоличествоДней > 0 Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала)  Тогда
				ТекущиеДанные.ДатаОкончания = ТекущиеДанные.ДатаНачала + (СекундВДне * (ТекущиеДанные.КоличествоДней -1));
			ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
				ТекущиеДанные.ДатаНачала = ТекущиеДанные.ДатаОкончания - (СекундВДне * (ТекущиеДанные.КоличествоДней -1));
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) И ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
				Если ТекущиеДанные.ДатаОкончания > ТекущиеДанные.ДатаНачала Тогда
						ТекущиеДанные.КоличествоДней = (ТекущиеДанные.ДатаОкончания - ТекущиеДанные.ДатаНачала)/СекундВДне +1;
				Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка дат!");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
