
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Получаем данные в виде Соответствия
	Сотрудники = ВКМ_ОбщийСервер.ТабличнаяЧастьВСоответствие(ОтпускаСотрудников);
	
	Движения.ВКМ_Отпуска.Записывать = Истина;
	Движения.ВКМ_Отпуска.Записать();
	
	Для Каждого Сотрудника Из Сотрудники Цикл
		ДнейВМесяцах = Сотрудника.Значение;
		Для Каждого Месяца Из ДнейВМесяцах Цикл
			Движение = Движения.ВКМ_Отпуска.Добавить();
			Движение.Период = Дата;
			Движение.Год = Год;
			Движение.Сотрудник = Сотрудника.Ключ;
			Движение.Месяц = Месяца.Ключ;
			Движение.ДнейПлан = Месяца.Значение;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
