
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Получаем данные
	Сотрудники = Новый Соответствие();

	Для Каждого Строка Из ОтпускаСотрудников Цикл
		МесяцН = Месяц(Строка.ДатаНачала);
		МесяцК = Месяц(Строка.ДатаОкончания);
		
		ЗначениеСотрудник = Сотрудники.Получить(Строка.Сотрудник);
		Если ЗначениеСотрудник = Неопределено Тогда
			ДнейОтпускаВМесяце = Новый Соответствие();
		Иначе
			ДнейОтпускаВМесяце = ЗначениеСотрудник;
		КонецЕсли;
		
		Если МесяцН = МесяцК Тогда 
			ЗначениеДней = ДнейОтпускаВМесяце.Получить(МесяцН);
			Если ЗначениеДней = Неопределено Тогда
				ДнейОтпускаВМесяце.Вставить(МесяцН, Строка.КоличествоДней);
			Иначе
				ДнейОтпускаВМесяце.Вставить(МесяцН,ЗначениеДней + Строка.КоличествоДней );
			КонецЕсли;
		Иначе
			КолМесяцН = (День(КонецМесяца(Строка.ДатаНачала))-День(Строка.ДатаНачала))+ 1;
			КолМесяцК = (День(Строка.ДатаОкончания) - День(НачалоМесяца(Строка.ДатаОкончания))) + 1;
			ЗначениеДней = ДнейОтпускаВМесяце.Получить(МесяцН);
			Если ЗначениеДней = Неопределено Тогда
				ЗначениеДней = КолМесяцН;
			Иначе
				ЗначениеДней = ЗначениеДней + КолМесяцН;
			КонецЕсли;
			ДнейОтпускаВМесяце.Вставить(МесяцН, ЗначениеДней);
			
			ЗначениеДней = ДнейОтпускаВМесяце.Получить(МесяцК);
			Если ЗначениеДней = Неопределено Тогда
				ЗначениеДней = КолМесяцК;
			Иначе
				ЗначениеДней = ЗначениеДней + КолМесяцК;
			КонецЕсли;
			ДнейОтпускаВМесяце.Вставить(МесяцК, ЗначениеДней);
		КонецЕсли;
		
		Сотрудники.Вставить(Строка.Сотрудник, ДнейОтпускаВМесяце);
	КонецЦикла;
	
	Движения.ВКМ_Отпуска.Записывать = Истина;
	Движения.ВКМ_Отпуска.Записать();
	
	Для Каждого Сотрудника Из Сотрудники Цикл
		ДнейВМесяцах = Сотрудника.Значение;
		Для Каждого Месяца Из ДнейВМесяцах Цикл
			Движение = Движения.ВКМ_Отпуска.Добавить();
			Движение.Период = Дата;
			Движение.Год = Год;
			Движение.Сотрудник = Сотрудника.Ключ;
			Движение.Месяц = Месяца.Ключ;
			Движение.ДнейПлан = Месяца.Значение;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
