
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Получаем данные в виде Соответствия
	Сотрудники = ВКМ_ОбщийСервер.ТабличнаяЧастьВСоответствие(ОтпускаСотрудников);
	
//	Движения.ВКМ_Отпуска.Записывать = Истина;
//	Движения.ВКМ_Отпуска.Записать();
	
	НаборЗаписей = РегистрыСведений.ВКМ_Отпуска.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Записать();
	
	Для Каждого Сотрудника Из Сотрудники Цикл
		ДнейВМесяцах = Сотрудника.Значение;
		Для Каждого Месяца Из ДнейВМесяцах Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Период = Дата;
			Запись.Документ = Ссылка;
			Запись.Год = Год;
			Запись.Сотрудник = Сотрудника.Ключ;
			Запись.Месяц = Месяца.Ключ;
			Запись.ДнейПлан = Месяца.Значение;
		КонецЦикла;
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
