
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьСписок(Команда)
	ЗаполнитьСписокНаСервере();
	Если Объект.Выплаты.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет начислений и остатков по выплатам в указанном периоде времени по сотрудникам! Список пуст.");
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьСписокНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.текст = "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаКВыплате
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&ДатаВыплаты,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	
	Запрос.УстановитьПараметр("ДатаВыплаты",КонецМесяца(Объект.Дата));
	Результат = Запрос.Выполнить();
	Список = Результат.Выгрузить();
	
	Объект.Выплаты.Очистить();
	Объект.Выплаты.Загрузить(Список);
	
КонецПроцедуры
#КонецОбласти

