

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники


&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Отбор = Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник);
	Строки = Объект.Сотрудники.НайтиСтроки(Отбор);
	Если Строки.Количество()>1 Тогда
		Шаблон = СтрШаблон("Выбранный сотрудник ""%1"" уже есть в списке! Укажите другого.",
			ТекущиеДанные.Сотрудник);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Шаблон,,
		"Сотрудники["+ Элементы.Сотрудники.ТекущаяСтрока  + "].Сотрудник", "Объект");
		ТекущиеДанные.Сотрудник = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

