
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьАкты(Команда)
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не задан период для формирования актов!", ,"Объект.Период");
		Возврат;
	КонецЕсли;
	
	СоздатьАктыНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СоздатьАктыНаСервере()
	
	//Первоночальное заполнение ТЧ (Договорами и Актами к ним если они есть)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.ВидДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачала КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВКМ_ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2999, 12, 31, 23, 59, 59)
	|		ИНАЧЕ ДоговорыКонтрагентов.ВКМ_ДатаОкончания
	|	КОНЕЦ КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_Договора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И (ДоговорыКонтрагентов.ВКМ_ДатаНачала <= &ДатаК
	|	И ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВКМ_ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2999, 12, 31, 23, 59, 59)
	|		ИНАЧЕ ДоговорыКонтрагентов.ВКМ_ДатаОкончания
	|	КОНЕЦ > &ДатаН)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Акт,
	|	РеализацияТоваровУслуг.Договор
	|ПОМЕСТИТЬ ВТ_Акты
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договора.Договор,
	|	ЕСТЬNULL(ВТ_Акты.Акт, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Акт
	|ИЗ
	|	ВТ_Договора КАК ВТ_Договора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Акты КАК ВТ_Акты
	|		ПО ВТ_Договора.Договор = ВТ_Акты.Договор";
	
	Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание );
	Запрос.УстановитьПараметр("ДатаН",Объект.Период.ДатаНачала );
	Запрос.УстановитьПараметр("ДатаК", Объект.Период.ДатаОкончания);
	
	Результат = Запрос.Выполнить();
	Объект.Договора.Загрузить(Результат.Выгрузить());
	
	
	//Обход ТЧ и формирование актов
	

КонецПроцедуры


#КонецОбласти

