
#Область ПрограммныйИнтерфейс

// Месяц строкой.
// 
// Параметры:
//  Месяц - число - 
// 
// Возвращаемое значение:
//  Произвольный, Строка - Месяц строкой
Функция МесяцСтрокой(Месяц) Экспорт
	
	Месяца = Новый Соответствие;
	Месяца.Вставить(1,"Январь");
	Месяца.Вставить(2,"Февраль");
	Месяца.Вставить(3,"Март");
	Месяца.Вставить(4,"Апрель");
	Месяца.Вставить(5,"Май");
	Месяца.Вставить(6,"Июнь");
	Месяца.Вставить(7,"Июль");
	Месяца.Вставить(8,"Август");
	Месяца.Вставить(9,"Сентябрь");
	Месяца.Вставить(10,"Октябрь");
	Месяца.Вставить(11,"Ноябрь");
	Месяца.Вставить(12,"Декабрь");
	
	Возврат Месяца.Получить(Месяц);
	
КонецФункции


// Табличная часть в соответствие.
// 
// Параметры:
//  Таблица - ТаблицаЗначений -
// Возвращаемое значение:
//  - Соответствие из КлючИЗначение:
//                           * Ключ     - ЛюбаяСсылка - ссылка на сотрудника;
//                           * Значение -   Соответствие из КлючИЗначение:
//                                           * Ключ1     - Строка - месяци;
//                                           * Значение1 - Число - количество дней.
Функция ТабличнаяЧастьВСоответствие(Таблица) Экспорт

	Сотрудники = Новый Соответствие();

	Для Каждого Строка Из Таблица Цикл
		МесяцН = Месяц(Строка.ДатаНачала);
		МесяцК = Месяц(Строка.ДатаОкончания);
		
		ЗначениеСотрудник = Сотрудники.Получить(Строка.Сотрудник);
		Если ЗначениеСотрудник = Неопределено Тогда
			ДнейОтпускаВМесяце = Новый Соответствие();
		Иначе
			ДнейОтпускаВМесяце = ЗначениеСотрудник;
		КонецЕсли;
		
		Если МесяцН = МесяцК Тогда 
			КоличествоДней = День(Строка.ДатаОкончания) - День(Строка.ДатаНачала) + 1;
			ЗначениеДней = ДнейОтпускаВМесяце.Получить(МесяцН);
			Если ЗначениеДней = Неопределено Тогда
				ДнейОтпускаВМесяце.Вставить(МесяцН, КоличествоДней);
			Иначе
				ДнейОтпускаВМесяце.Вставить(МесяцН,ЗначениеДней + КоличествоДней );
			КонецЕсли;
		Иначе
			КолМесяцН = (День(КонецМесяца(Строка.ДатаНачала))-День(Строка.ДатаНачала))+ 1;
			КолМесяцК = (День(Строка.ДатаОкончания) - День(НачалоМесяца(Строка.ДатаОкончания))) + 1;
			ЗначениеДней = ДнейОтпускаВМесяце.Получить(МесяцН);
			Если ЗначениеДней = Неопределено Тогда
				ЗначениеДней = КолМесяцН;
			Иначе
				ЗначениеДней = ЗначениеДней + КолМесяцН;
			КонецЕсли;
			ДнейОтпускаВМесяце.Вставить(МесяцН, ЗначениеДней);
			
			ЗначениеДней = ДнейОтпускаВМесяце.Получить(МесяцК);
			Если ЗначениеДней = Неопределено Тогда
				ЗначениеДней = КолМесяцК;
			Иначе
				ЗначениеДней = ЗначениеДней + КолМесяцК;
			КонецЕсли;
			ДнейОтпускаВМесяце.Вставить(МесяцК, ЗначениеДней);
		КонецЕсли;
		
		Сотрудники.Вставить(Строка.Сотрудник, ДнейОтпускаВМесяце);
	КонецЦикла;
	
	Возврат Сотрудники
КонецФункции

#КонецОбласти


