
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Сотрудники.Количество() = 0 Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Отмена проведения! Табличная часть документа пуста.");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УстановкаОкладовСотрудники.Сотрудник КАК Сотрудник,
	|	ВКМ_УстановкаОкладовСотрудники.Сотрудник.КатегорияСотрудника КАК КатегорияСотрудника,
	|	ВКМ_УстановкаОкладовСотрудники.Оклад,
	|	ВКМ_УстановкаОкладовСотрудники.Процент
	|ИЗ
	|	Документ.ВКМ_УстановкаОкладов.Сотрудники КАК ВКМ_УстановкаОкладовСотрудники
	|ГДЕ
	|	ВКМ_УстановкаОкладовСотрудники.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
		
	// регистр ВКМ_УсловияОплатыСотрудников
	Движения.ВКМ_УсловияОплатыСотрудников.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_УсловияОплатыСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Оклад = Выборка.Оклад;
		Если Выборка.КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудника.Специалист Тогда
		     Движение.ПроцентОтРабот = ВЫборка.Процент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры
#КонецОбласти



#КонецЕсли
